// pages/aboutUsPage/aboutUsPage.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '基于毫米波与AI的生命体征监测与情绪识别系统',
    intro: '第七次全国人口普查结果显示，我国60岁及以上人口为26402万人，占总人口的18.70%，人口老龄化问题持续严重加深。而随着近年来越来越多的子女选择和父母分开居住，空巢老人的数量逐年递增，独居老人在家中遭遇许多突发情况时，时常处于无人知晓的尴尬处境。传统家庭养老功能不完善，居家养老面临挑战。',
    aboutUs1: '本项目通过自主研发基于毫米波与AI的智能感知系统，运用毫米波雷达技术、人工智能算法对监测的人体信号进行分析识别，在保护用户隐私的基础上，实现更加精细化、智能化、非接触式的心率、呼吸率监测与情绪状态识别。',
    aboutUs2: '采用自主开发的微弱信号提取算法解析生命体征信号，旨在实现对老年人人体生命体征（心率、呼吸率）的实时监测与AI分析，同时识别老年人的情绪状态，及时监测出人体生命体征或情绪异常并发出预警，从身体健康与心理健康两方面对老年人实现非接触式无感远程监护，缓解当代社会的养老难题，改善传统家庭养老方案，面向社区养老、居家养老等，赋能智慧康养。',
    projectMember: [
      {
        job: '生命体征检测算法开发',
        memberList: ['邓锦龙','张家俊']
      },
      {
        job: 'RCG情绪识别算法开发',
        memberList: ['杨柳奕']
      },
      {
        job: '小程序前端开发&UI设计',
        memberList: ['林赞炜']
      },
      {
        job: '小程序后端开发&数据库开发',
        memberList: ['陈益润']
      },
      {
        job: '检测数据分析与处理',
        memberList: ['李思敏']
      },
      {
        job: '信号处理算法开发',
        memberList: ['柳焱','游燕云']
      },
      {
        job: '信号处理算法测试与验证',
        memberList: ['谭卓宏']
      },
      {
        job: '样机设计与数据分析',
        memberList: ['林冰纯']
      },
      {
        job: '样机3D建模与打印',
        memberList: ['陈家伟']
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})